#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
data.aws_availability_zones.available: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
data.aws_availability_zones.available: Read complete after 0s [id=eu-north-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 0
      + tags              = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-vpc-eu-north-1a"
        }
      + tags_all             = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-vpc-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
      + vpc                  = true
    }

  # module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                 = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "vpc-flow-log-to-cloudwatch-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all    = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
    }

  # module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-vpc"
        }
      + tags_all = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-vpc"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-vpc-eu-north-1a"
        }
      + tags_all             = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-vpc-eu-north-1a"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-vpc-private"
        }
      + tags_all         = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-vpc-private"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-vpc-public"
        }
      + tags_all         = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-vpc-public"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                         = "ex-vpc"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
          + "Name"                            = "ex-vpc-private-eu-north-1a"
          + "kubernetes.io/cluster/ex-vpc"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                      = "Terraformm"
          + "Description"                     = "For General Purposes"
          + "Environment"                     = "Development"
          + "Example"                         = "ex-vpc"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
          + "Name"                            = "ex-vpc-private-eu-north-1a"
          + "OwnerEmail"                      = "devops@example.com"
          + "Team"                            = "DevOps"
          + "Termination date"                = "Permanent"
          + "Type"                            = "Networking"
          + "kubernetes.io/cluster/ex-vpc"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                         = "ex-vpc"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
          + "Name"                            = "ex-vpc-private-eu-north-1b"
          + "kubernetes.io/cluster/ex-vpc"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                      = "Terraformm"
          + "Description"                     = "For General Purposes"
          + "Environment"                     = "Development"
          + "Example"                         = "ex-vpc"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
          + "Name"                            = "ex-vpc-private-eu-north-1b"
          + "OwnerEmail"                      = "devops@example.com"
          + "Team"                            = "DevOps"
          + "Termination date"                = "Permanent"
          + "Type"                            = "Networking"
          + "kubernetes.io/cluster/ex-vpc"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                         = "ex-vpc"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
          + "Name"                            = "ex-vpc-private-eu-north-1c"
          + "kubernetes.io/cluster/ex-vpc"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                      = "Terraformm"
          + "Description"                     = "For General Purposes"
          + "Environment"                     = "Development"
          + "Example"                         = "ex-vpc"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
          + "Name"                            = "ex-vpc-private-eu-north-1c"
          + "OwnerEmail"                      = "devops@example.com"
          + "Team"                            = "DevOps"
          + "Termination date"                = "Permanent"
          + "Type"                            = "Networking"
          + "kubernetes.io/cluster/ex-vpc"    = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                      = "ex-vpc"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-vpc-public-eu-north-1a"
          + "kubernetes.io/cluster/ex-vpc" = "shared"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                   = "Terraformm"
          + "Description"                  = "For General Purposes"
          + "Environment"                  = "Development"
          + "Example"                      = "ex-vpc"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-vpc-public-eu-north-1a"
          + "OwnerEmail"                   = "devops@example.com"
          + "Team"                         = "DevOps"
          + "Termination date"             = "Permanent"
          + "Type"                         = "Networking"
          + "kubernetes.io/cluster/ex-vpc" = "shared"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                      = "ex-vpc"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-vpc-public-eu-north-1b"
          + "kubernetes.io/cluster/ex-vpc" = "shared"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                   = "Terraformm"
          + "Description"                  = "For General Purposes"
          + "Environment"                  = "Development"
          + "Example"                      = "ex-vpc"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-vpc-public-eu-north-1b"
          + "OwnerEmail"                   = "devops@example.com"
          + "Team"                         = "DevOps"
          + "Termination date"             = "Permanent"
          + "Type"                         = "Networking"
          + "kubernetes.io/cluster/ex-vpc" = "shared"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"                      = "ex-vpc"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-vpc-public-eu-north-1c"
          + "kubernetes.io/cluster/ex-vpc" = "shared"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "DeployedBy"                   = "Terraformm"
          + "Description"                  = "For General Purposes"
          + "Environment"                  = "Development"
          + "Example"                      = "ex-vpc"
          + "GithubOrg"                    = "terraform-aws-modules"
          + "GithubRepo"                   = "terraform-aws-eks"
          + "Name"                         = "ex-vpc-public-eu-north-1c"
          + "OwnerEmail"                   = "devops@example.com"
          + "Team"                         = "DevOps"
          + "Termination date"             = "Permanent"
          + "Type"                         = "Networking"
          + "kubernetes.io/cluster/ex-vpc" = "shared"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Example"    = "ex-vpc"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "ex-vpc"
        }
      + tags_all                             = {
          + "DeployedBy"       = "Terraformm"
          + "Description"      = "For General Purposes"
          + "Environment"      = "Development"
          + "Example"          = "ex-vpc"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "Name"             = "ex-vpc"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "Termination date" = "Permanent"
          + "Type"             = "Networking"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnets = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr_block  = "10.0.0.0/16"
  + vpc_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: d9345800bc05277fdb862ea4bbacf6b74f63e402

*Pusher: @vvvegero97, Action: `pull_request`, Working Directory: `eu-north-1/networking/vpc`, Workflow: `Terraform CI/CD`*